# THE BASICS AND THE MYSQL CLIENT

Estos comandos sirven para pedir ayuda en MySQL

In [6]:
help contents;

No delimiter was found in the SQL code

In [5]:
help Data Manipulation;

In [8]:
help SHOW DATABASES;

### Empezando a explorar bases de datos

In [2]:
SHOW DATABASES;

### Primeros comandos de SQL

In [8]:
CREATE TABLE test.books (book_id INT, title TEXT, status INT);

ERROR 1050 (42S01): Table 'books' already exists

In [9]:
SHOW TABLES FROM test;

In [10]:
USE test;

In [11]:
SHOW TABLES;

In [12]:
DESCRIBE books;

### Inserting and Manipulating Data

In [13]:
INSERT INTO books VALUES(100, 'Heart of Darkness', 0);
INSERT INTO books VALUES(101, 'The Catcher of the Rye', 1);
INSERT INTO books VALUES(102, 'My Antonia', 0);

In [14]:
SELECT * FROM books;

In [15]:
SELECT * FROM books WHERE status = 1;

In [18]:
SELECT * FROM books WHERE status = 0;

In [19]:
UPDATE books SET status = 1 WHERE book_id = 102;

In [20]:
SELECT * FROM books WHERE status = 1;

In [21]:
UPDATE books SET status = 0 WHERE book_id = 101;
SELECT * FROM books WHERE status = 0;

In [22]:
UPDATE books
SET title = 'The Catcher in the Rye', status = 1
WHERE book_id = 101;

### A Little Complexity

In [24]:
CREATE TABLE status_names (status_id INT, status_name CHAR(8));
INSERT INTO status_names VALUES(0, 'Inactive'), (1,'Active');

In [25]:
SHOW TABLES;

In [26]:
SELECT * FROM status_names;

In [27]:
SELECT book_id, title, status_name
FROM books JOIN status_names
WHERE status = status_id;

### Summary

There’s plenty more you can do to explore the simple tables we’ve created, but in this
chapter I wanted just to give you an overview of MySQL and MariaDB, and to show
you around. The chapters in Part II will delve into details, starting with Chapter 4, which
will cover creating tables in detail. Before jumping ahead, you might want to reinforce what you just learned from this
chapter. A few exercises follow for you to play some more on your own with the test
database and the mysql client. When you’re finished, to exit mysql, type quit or exit,
and press the Enter key.